const localContent:any = {
    'ប្រទេសកម្ពុជា': `ព្រះរាជាណាចក្រកម្ពុជាហៅកាត់ថាកម្ពុជា គឺជាប្រទេសមួយមានទីតាំងស្ថិតនៅភូមិភាគអាស៊ីអាគ្នេយ៍ ខាងត្បូងឧបទ្វីបឥណ្ឌូចិន មានព្រំដែនជាប់ប្រទេសថៃ ប្រទេសឡាវ និងជាប់ប្រទេសវៀតណាម។ ព្រំដែនសមុទ្រលាតសន្ធឹងលើឈូងសមុទ្រថៃ ។ កម្ពុជាមានខេត្ត និងក្រុងចំនួន ២៥ និងមានរាជធានីដែលហៅថា រាជធានីភ្នំពេញ។ទីតាំងភូមិសាស្ត្រ
    ប្រទេសកម្ពុជាមានផ្ទៃដី ១៨១ ០៣៥ គីឡូម៉ែតការ៉េ មានព្រំដែនដីគោក ខាងជើងនិង​ខាងលិច ជាប់ប្រទេសថៃ ៨០០គ.ម ជាប់ប្រទេសឡាវ៥៤១គ.មភាគខាងឥសាន និងជាប់ប្រទេសវៀតណាម ១២២៨គ.មភាគខាងកើតនិងអាគ្នេយ៍។ ព្រំដែនសមុទ្រលាតសន្ធឹងលើឈូងសមុទ្រថៃ ប្រវែង៤៤៣គ.ម។ ទីតាំងភូមិសាស្ត្រនេះបានផ្តល់នូវទំនាក់ទំនងងាយស្រួលក្នុងវិស័យសេដ្ឋកិច្ច ទេសចរណ៍ជាមួយប្រទេសជិតខាង និង លើពិភពលោក។ ដោយយោងទៅលើកូអរដោនេភូមិសាស្ត្រប្រទេសកម្ពុជាស្ថិតនៅត្រង់ចន្លោះខ្សែស្របទី១០ និង ទី១៥ នៃរយៈទទឹងខាងជើង និង ត្រង់ចន្លោះខ្សែបណ្តោយទី១០២ និង ទី១០៨ នៃរយៈបណ្តោយខាងកើត។ កូអរដោនេភូមិសាស្ត្រនេះបញ្ជាក់អោយឃើញច្បាស់ថា ប្រទេសកម្ពុជាស្ថិតនៅតំបន់ត្រូពិចគឺក្តៅហើយសើម ម៉្យាងទៀតស្ថិតក្នុងតំបន់អាស៊ីមូសុងគឺសំបូរភ្លៀងដែលជាតំបន់មានលក្ខណៈល្អប្រសើរដល់ការលូតលាស់នៃរុក្ខជាតិដំណាំគ្រប់ប្រភេទ។ តំបន់ភ្នំគឺស្ថិតនៅភាគខាងជើង និងបូព៌ា ប៉ុន្តែដីភាគច្រើនមានលក្ខណៈរាបស្មើ ដែលល្អឥតខ្ចោះសម្រាប់ការដាំដុះស្រូវ។ ជាក់ស្ដែងថ្មីៗ អង្ករផ្កាម្លិះរបស់ប្រទេសកម្ពុជាបានទទួលជោគជ័យក្នុងការប្រកួតប្រជែងអង្ករដែលល្អបំផុតលើពិភពលោកចំនួនបីដង។ តំបន់វាលស្រែបៃតង និងដើមឈើ ត្រូវបានផ្តល់ឱ្យដោយបឹងទន្លេសាបយក្សនិងទន្លេមេគង្គដ៏ល្បីល្បាញដែលជាទន្លេវែងបំផុតទី 12 នៅលើពិភពលោកដែលហូរកាត់ប្រទេស និងរាជធានីភ្នំពេញ។ រ៉ែថ្មីៗប្រេងកាតនិងឧស្ម័នធម្មជាតិត្រូវបានរកឃើញនៅក្រោមទឹកដីរបស់ប្រទេសកម្ពុជា ទ្រព្យសម្បត្តិដ៏មានតម្លៃដែលពិតជានឹងចូលរួមចំណែកក្នុងសេដ្ឋកិច្ចដ៏រីកចំរើននេះ។
    
    អាកាសធាតុ
    ប្រទេសកម្ពុជា ជាប្រទេសដែលទទួលឥទ្ធិពលខ្យល់មូសុងគឺក្តៅហើយសើម។ គេចែករដូវនៅប្រទេសកម្ពុជាជាពីរធំៗរដូវប្រាំង និងរដូវវស្សា។ រដូវប្រាំងជារដូវក្តៅហើយស្ងួតចាប់ពីខែវិច្ឆិកាដល់ខែមករា (រដូវរំហើយ) ដែលមានអាកាសធាតុត្រជាក់ស្រួល ហើយចាប់ពីខែកុម្ភៈដល់ខែមេសាគឺមានអាកាសធាតុក្តៅហួតហែង ពិបាកនឹងរស់នៅទាំងមនុស្ស សត្វ និងរុក្ខជាតិ។ រដូវវស្សាចាប់ពីខែឧសភាដល់ខែតុលា ខ្យល់មូសុងបក់មកពីទិសនិរតីដែលជាខ្យល់ក្តៅតែសើម និងមានភ្លៀងធ្លាក់ច្រើនមានឈ្មោះថា (មូសុងវស្សា) ។ ឥទ្ធិពលខ្យល់មូសុងមានស្ទើនៅគ្រប់ទីកន្លែងនៃប្រទេសកម្ពុជាដែលធ្វើឲ្យមានលក្ខណៈពិសេសបង្កើតរបបទឹកភ្លៀង និងរដូវយ៉ាងទៀងទាត់។ប្រជាជន
    ប្រជាជនសរុបរបស់កម្ពុជាមានចំនួន ១៥,២៨៨,៤៨៩នាក់គិតត្រឹមថ្ងៃទី០៣ ខែមីនា ឆ្នាំ២០១៩ ក្នុងនោះមានប្រុស៧,៤១៨,៥៧៧នាក់ និងស្រី៧,៨៦៩,៩១២នាក់។ ចំនួនប្រជាជនសរុបកើនឡើង ១,៨៩២,៨០៧នាក់ ត្រូវនឹង១៤.១ភាគរយ រយៈពេល១១ឆ្នាំ រវាងឆ្នាំ២០០៨ និងឆ្នាំ២០១៩។ ក្នុងនោះក្រុមជនជាតិភាគតិចមួយចំនួនបានតាំងទីលំនៅនៅកម្ពុជារាប់រយឆ្នាំមកហើយរួមទាំងជនជាតិចាម ចិន ឥណ្ឌា វៀតណាម ថៃ គួយ ស្ទៀង និងតាមិល។ បច្ចុប្បន្នមានជនបរទេសជាច្រើនបានបន្លាស់ទីមករស់នៅក្នុងកម្ពុជា។ ភាសាខ្មែរជាភាសាផ្លូវការនៅកម្ពុជា។ 
    
    សាសនា
    រដ្ឋធម្មនុញ្ញ ច្បាប់​ដទៃ​ទៀត និង​គោលនយោបាយ​នានា​ការពារ​សេរីភាព​សាសនា​។ រដ្ឋធម្មនុញ្ញ​ហាមប្រាម​ការ​រើសអើង ដោយសារ​សាសនា ។ ពុទ្ធសាសនា​គឺ​ជា​សាសនា​របស់​រដ្ឋ ប្រជាជន​ប្រហែល ៩៦​% កាន់​ពុទ្ធសាសនា​ហិនយាន​។ ជនជាតិ​ខ្មែរ​ភាគ​ច្រើន​លើស​លុប​ជា​ពុទ្ធសាសនិក ។ មាន​ទំនាក់ទំនង​គ្នា​យ៉ាង​ជិតស្និទ្ធ​រវាង​ពុទ្ធសាសនា ប្រពៃណី​វប្បធម៌ និង​អត្តសញ្ញាណ​ខ្មែរ និង​ជីវិត​រស់នៅ​ប្រចាំ​ថ្ងៃ​។ សាសនាដទៃទៀតរូមមាន សាសនា​ឥស្លាម សាសនា​គ្រឹះ​និកាយ និងសាសនាហិណ្ឌូជាដើមក៏ត្រូវបានគោរពប្រតិបត្តិផងដែរ។
    
    ភាសា
    ភាសាខ្មែរ ឬ ខ្មែរ គឺជាភាសាមួយនៃជនជាតិខ្មែរ និង ជាភាសាជាផ្លូវការនៃប្រទេសកម្ពុជា ។ វាជាភាសាមួយក្នុងចំណោមភាសាដែលចាស់ជាងគេនៅក្នុងតំបន់ហើយវាមានដើមកំណើតមកពីអម្បូរមន - ខ្មែរ ជាជនជាតិដែលចាស់ជាងគេ ហើយជនជាតិនេះមានវប្បធម៌-អារ្យធម៌របស់ខ្លូនផ្ទាល់យ៉ាងហោចណាស់ក៏ពីរវាង ១លានឆ្នាំ មុនគ.សមកហើយដែរ។ វាត្រូវបានកត់សម្គាល់សម្រាប់អក្ខរក្រមទូលំទូលាយរបស់វាដោយមានព្យញ្ជនៈ 33 ស្រះ 23 និងស្រះឯករាជ្យ 12 ។ មិនដូចភាសាអាស៊ីដទៃទេខ្មែរមិនមែនជាសំនៀងទេដូច្នេះវាងាយស្រួលសម្រាប់ជនបរទេស។ ខណៈពេលដែលការរៀនឃ្លាសាមញ្ញគឺអាចទាក់ទងទៅជនបរទេសបាន។
    
    ទង់ជាតិ
    ទង់ជាតិកម្ពុជាត្រូវបានអនុម័តដោយសភាជាតិក្រោយការបោះឆ្នោតជាសកលលើកដំបូង ក្នុងប្រទេសកម្ពុជានាឆ្នាំ១៩៤៧។ ទង់ជាតិនេះតំណាងឲ្យប្រទេសកម្ពុជាស្វយ័តក្នុងសហភាពបារាំង ហើយក្រោយមកក្លាយជាទង់ជាតិនៃប្រទេសកម្ពុជាឯករាជ្យ រហូតដល់រដ្ឋប្រហារឆ្នាំ១៩៧០។ ចលនាកងទ័ពជាតិសីហនុនិយមប្រើប្រាស់ទង់ជាតិនេះជាតំណាង ពីឆ្នាំ១៩៧៩ ដល់ឆ្នាំ១៩៨៩។ ទង់ជាតិនេះត្រូវបានប្រើប្រាស់ឡើងវិញចាប់ពីការប្រកាសព្រះរាជាណាចក្រកម្ពុជា(ទីពីរ) នាឆ្នាំ១៩៩៣ រហូតមកដល់សព្វថ្ងៃ។ ប្រាសាទអង្គរវត្តតំណាងឲ្យសាសនាព្រះពុទ្ធនៃប្រទេសរួមជាមួយកិត្តិយសនិងមរតកនៃប្រជាជនខ្មែរ។ ខ្សែពណ៌ខៀវតំណាងឲ្យព្រះមហាក្សត្រហើយក៏មានសេរីភាពនិងកិច្ចសហប្រតិបត្តិការផងដែរ។ ពណ៌ក្រហមតំណាងឲ្យមនុស្សហើយក៏បង្ហាញពីភាពក្លាហានផងដែរ។ សរុបសេចក្ដីទង់ជាតិបានសង្ខេបពាក្យស្លោកថា " ជាតិ សាសនា ព្រះមហាក្សត្រ " ។ផ្កាតំណាងជាតិ
    ប្រទេស​កម្ពុជា​បានកំណត់​យក​រំដួល​ធ្វើជា​ផ្កា​តំណាង​អត្តសញ្ញាណ​របស់​ជាតិ​តាម​ព្រះរាជ​ក្រិ​ត្យ​ចុះ​ថ្ងៃទី​២១ ខែមីនា ឆ្នាំ​២០០៥​។ ការ​សម្រេចយក​រំដួល​ជា​ផ្កា​និមិត្តរូប​សម្រាប់​ប្រជាជាតិ​របស់ខ្លួន​នោះ ក៏​ដោយសារតែ​ផ្ការំដួល​មាន​ក្លិនពិដោរ​ក្រអូប ឈ្ងុយ​ឈ្ងប់ គួរ​ជាទី​ទាក់ទាញ អារម្មណ៍ របស់​មហាជន​ទូទៅ និង​ផ្តល់នូវ​អត្ថប្រយោជន៍​ច្រើន​ផងដែរ​នៅក្នុង​សង្គម​ខ្មែរ​។​ ​ចាស់​បុរាណ​ខ្មែរ​តែងតែ​ធ្វើការ​ប្រដូច​ស្រី​ក្រមុំ​ទៅនឹង​ផ្ការំដួល ក៏​ព្រោះតែ​ផ្ការំដួល​មាន​រូបរាង​ស្រស់ស្អាត​និង​មាន​ក្លិនពិដោរ​ក្រអូប​ឈ្ងុយ​ឈ្ងប់ គួរ​ជាទី ទាក់ទាញ​អារម្មណ៍ របស់​មហាជន​ទូទៅ​។ ក្រៅពី​ប្រដូច​ផ្ការំដួល​ទៅនឹង​នារី​ខ្មែរ​តាមរយៈ​ក្លិន​នោះ​ក្នុងនោះ​ផ្ការំដួល​ក៏ត្រូវ​បាន​កវីនិពន្ធ​ខ្មែរ មួយចំនួន បានធ្វើការ​អត្ថាធិប្បាយ​រៀបរាប់​ពី​សម្រស់​ល្អគន់ និង​គុណសម្បត្តិ​របស់​ផ្ការំដួល​តាមរយៈ​អត្ថន័យ​នៃ​បទ​ចម្រៀង​ផងដែរ​។​ ​បច្ចុប្បន្ន​ដើម​ផ្ការំដួល​គេ​អាច​រកមើល​បាន​នៅតាម​សួនច្បារ​មួយចំនួន​ក្នុងប្រទេស​កម្ពុជា​។ ក្រៅពី​យក​ផ្ការំដួល​តំណាងអោយ ប្រទេស​កម្ពុជា ហើយ​នោះ ខាង​មន្ទីរ​កសិកម្ម​ក៏បាន​យក​ផ្កា​នេះ​តំណាងអោយ​វិស័យ​កសិកម្ម​ផងដែរ​។ ដូច្នេះ​ប្រជាជន​ខ្មែរ​គ្រប់រូប​ពិសេស យុវវ័យ​ខ្មែរ​ទាំងអស់ ចូរ​ចងចាំ និង​ធ្វើខ្លួន​អោយមាន​ក្លិនក្រអូប និង​ស្រស់ស្អាត​ដូចជា​ផ្ការំដួល​ដែល​តំណាងអោយ​ប្រទេស​ក៏ដូចជា​ខ្លួន​ផ្ទាល់​។ការប្តូរប្រាក់
    ប្រាក់រៀល (រៀល) ជារូបិយប័ណ្ណផ្លូវការ ប៉ុន្តែប្រាក់ដុល្លាអាមេរិចក៏ត្រូវបានប្រើប្រាស់សម្រាប់ការទូទាត់ក្នុងទីផ្សារនៃព្រះរាជាណាចក្រកម្ពុជា។ មួយដុល្លាអាមេរិចអាចប្តូរបានក្នុងរង្វង់ បួនពាន់រៀល អាស្រ័យលើអាត្រាប្តូរប្រាក់ផ្លូវការ។អគ្គីសនី
    វ៉ុល: ២៣០ វ៉ុល
    
    ប្រេកង់: ៥០ ហឺត
    
    រូបភាព - រន្ធដោតថាមពល
    
    វ៉ុលស្តង់ដារនៅក្នុងប្រទេសកម្ពុជាគឺ ២៣០ វ៉ាត់ហើយហ្វ្រេកង់មានកម្រិត 50Hz ។
    
    ទិញលេខទូរស័ព្ទ / ស៊ីមកាត
    អ្នកអាចទិញស៊ីមកាតនិងលេខទូរស័ព្ទនៅខាងក្រៅស្ថានីយមកដល់អាកាសយានដ្ឋានអន្តរជាតិភ្នំពេញឬពីហាងលក់ទូរស័ព្ទជាច្រើនកន្លែងនៅទូទាំងទីក្រុង។ លិខិតឆ្លងដែននិងទិដ្ឋាការមានសុពលភាពត្រូវបានទាមទារ។
    
    ធនាគារ និង អេធីអឹម
    ធនាគារនៅក្នុងប្រទេសកម្ពុជាផ្តល់ជូននូវរូបិយប័ណ្ណ និងអ្នកដំណើរសម្រាប់ការផ្លាស់ប្តូរប័ណ្ណឥណទានសេវាផ្ទេរប្រាក់តាមទូរស័ព្ទ និងសេវាកម្មធនាគារដ៏ទៀងទាត់។ ធនាគារភាគច្រើនបើកពីចន្លោះម៉ោង 8:00 ដល់ម៉ោង 3:00 រឺ 4:00 ល្ងាច ពីថ្ងៃច័ន្ទដល់ថ្ងៃសុក្រ និងទីតាំងមួយចំនួនបើកពីរចន្លោះម៉ោង 8:00 ព្រឹក ដល់ 8:00 យប់ ពេញមួយសប្តាហ៍ ។ មួយចំនួនបើកនៅព្រឹកថ្ងៃសៅរ៍រហូតដល់ម៉ោង 11:30 ព្រឹក។ ម៉ាស៊ីនអេធីអឹមដែលមានទីតាំងនៅទូទាំងទីក្រុងមានសកម្មភាព 24/7 ទទួលយក Visa និង MasterCard ។ 
    
    ប័ណ្ណឥណទាន
    ប័ណ្ណឥណទានដែលចេញដោយធនាគារក្នុងស្រុក ឬប័ណ្ណឥណទានដែលមានលក្ខណៈសកល (វីសាកាត ម៉ាស្ទ័រកា) អាចទូទាត់ថ្លៃទំនិញ សេវាកម្មផ្សេងៗ នៅតាមទីតាំងអាជីវកម្មនានាទូទាំងព្រះរាជាណាចក្រកម្ពុជា។
    
    អ្នកដំណើរពិនិត្យ
    ការត្រួតពិនិត្យអ្នកដំណើរត្រូវបានទទួលយកនៅតាមធនាគារភាគច្រើនសណ្ឋាគារនិងអ្នកប្តូរប្រាក់មួយចំនួន។
    
    ផ្ទេរសាច់ប្រាក់
    ការផ្ទេរសាច់ប្រាក់ភ្លាមៗអាចធ្វើឡើងតាមរយៈ Western Union ឬ MoneyGram ។ ការផ្ទេរតាមទូរលេខធម្មតាអាចរកបាននៅគ្រប់ធនាគារទាំងអស់។
    
    ទិដ្ឋាការនៅលើការមកដល់
    Visa on Arrival អាចទទួលបាននៅបញ្ជរទិដ្ឋាការនៅពេលមកដល់ព្រលានយន្តហោះអន្តរជាតិភ្នំពេញ។ ទោះជាយ៉ាងណាក៏ដោយសូមកត់សម្គាល់ថាមិនមែនគ្រប់អ្នកកាន់លិខិតឆ្លងដែនបរទេសទាំងអស់អាចដាក់ពាក្យសុំទិដ្ឋាការនៅពេលមកដល់បានទេ។ ដូច្នេះវាមានសារៈសំខាន់ណាស់ក្នុងការត្រួតពិនិត្យជាមួយស្ថានទូតរ៉ូយ៉ាល់កម្ពុជាដែលនៅជិតបំផុតសម្រាប់តម្រូវការទិដ្ឋាការជាក់លាក់សម្រាប់ប្រទេសដែលមានជាប់ពាក់ព័ន្ធ។
    
    មធ្យោបាយដឹកជញ្ជូន
    ប្រទេសកម្ពុជាមានមធ្យោបាយដឹកជញ្ជូន ៣ប្រភេទសំខាន់ៗដូចជា ផ្លូវគោក ផ្លូវទឹក និងផ្លូវអាកាសសម្រាប់​ធ្វើ​ដំណើរ និង​ដឹកជញ្ជូន​ទំនិញផ្សេងៗ​នៅ​ក្នុង​ប្រទេស និង​ក្រៅ​ប្រទេស។ ក្នុងនោះផងដែរ គេបែងចែកផ្លូវគោក​ជា​ពីរ​ប្រភេទគឺ ផ្លូវ​ថ្នល់ និង ផ្លូវ​ដែក។ ដែលផ្លូវថ្នល់ទាំងអស់​មាន​ប្រវែង ៦០០០គ.ម ចែកជា​ផ្លូវ​ជាតិ (២៨០០គ.ម) ផ្លូវខេត្ត (១២០០គ.ម)និង​ផ្លូវរុក្ខបាល (២០០០គ.ម)។ ផ្លូវក្រាលកៅស៊ូហើយ​មាន​ប្រវែង ២០០០គ.ម ផ្លូវក្រាលថ្ម និង​ដី​ក្រហម​មានប្រវែង ២០០០គ.ម សល់ពី​នេះ​ជា​ផ្លូវ​លំ។ ផ្លូវដែកប្រទេសកម្ពុជាយើង​មាន ​២ខ្សែ។ ខ្សែទី១ ចេញពី​ភ្នំពេញទៅ​អូរជ្រៅ មានប្រវែង ៣៨៥គ.ម និងខ្សែទី២​ចេញពី​ភ្នំពេញ​ទៅ​ក្រុងព្រះសីហនុ មានប្រវែង ២៦៦គ.ម។ ផ្លូវដែក​នៅ​ប្រទេស​យើង​ទាំងពីរខ្សែ​នេះ​មិន​ទាន់​មាន​លក្ខណៈ​ទំនើប​នៅ​ឡើយ​ទេ។ ផ្លូវទឹក​ដែល​សំខាន់​គឺ​ទន្លេមេគង្គ (​ពី​ក្រចេះ​ដល់សមុទ្រ) ទន្លេសាប បឹងទន្លេសាប ទន្លេបាសាក់ និង​ដៃ​នានា។ប្រទេសកម្ពុជាយើង​មាន​កំពង់ផែ​ភ្នំពេញ​ដែល​អាច​ឲ្យ​នាវា​សមុទ្រ​ចត​បាន​សឹង​គ្រប់រដូវ។ ក្រៅ​ពី​កំពង់ផែ​ភ្នំពេញ កំពង់ផែ​កំពង់ចាម ក្រចេះ កំពង់ឆ្នាំង សៀមរាប...។ល។ កំពង់ផែ​ក្រុង​ព្រះ​សីហនុ ជាកំពង់ផែ​អន្តរជាតិ អាច​ទទួលបាន​នាវាសមុទ្រ​ធំៗចូលចត​បាន​គ្រប់​រដូវ។ ក្រៅពីនេះ​មាន​កំពង់ផែរាម ដែល​ប្រើប្រាស់​សម្រាប់ជា​មូលដ្ឋាន​នាវាចរណ៍​កងទ័ពខេមរភូមិន្ទ។ កំពង់ផែកោះកុង សម្រាប់ទូកយន្ត និង​នាវាតូចៗចត។ ការដឹកជញ្ជូនតាមផ្លូវអាកាស មាន​សកម្មភាព​ខ្លាំង​ក្លា​ជា​លំដាប់។ អាកាសយាន្តដ្ឋាន​សំខាន់ៗ​នៃ​ប្រទេស​កម្ពុជាយើង​គឺ អាកាសយាន្តដ្ឋាន​អន្តរជាតិ​ភ្នំពេញ និង សៀមរាប។ ក្រៅពីនេះ​មាន​អាកាសយាន្តដ្ឋាន​នៅ​តាមទី​រួម​ខេត្ត​និង​ក្រុង​ជាច្រើនទៀតដូចជា បាត់ដំបង រតនៈគីរី មណ្ឌលគីរី ស្ទឹងត្រែង កោះកុង និង ក្រុងព្រះសីហនុ។ អាកាសយាន្តដ្ឋាន​អន្តរជាតិ​ភ្នំពេញ​មាន​ផ្លូវចុះ​ប្រវែង ៣២០០ម ដែល​យន្តហោះ​ធន់ធ្ងន់​គ្រប់​ប្រភេទ​អាច​ចុះចត​បាន។`
    ,
    'debug':`តាំង ស្មោះ នុះ`,
    'englishDebug':`Cambodia, country on the Indochinese mainland of Southeast Asia. Cambodia is largely a land of plains and great rivers and lies amid important overland and river trade routes linking China to India and Southeast Asia. The influences of many Asian cultures, alongside those of France and the United States, can be seen in the capital, Phnom Penh, one of a handful of urban centres in the largely rural country.

    Cambodia
    Cambodia
    For 2,000 years Cambodia’s civilization absorbed influences from India and China and, in turn, transferred them to other Southeast Asian civilizations. From the Hindu-Buddhist kingdoms of Funan and Chenla (1st–8th century) through the classical age of the Angkor period (9th–15th century), it held sway over territories that are now part of Thailand, Vietnam, and Laos. The Khmer (Cambodian) empire reached its apex in the 12th century, a time marked by the construction of the massive temple complexes known as Angkor Wat and Bayon and the imperial capital of Angkor Thom. Following 400 years of decline, Cambodia became a French colony and during the 20th century experienced the turmoil of war, occupation by the Japanese, postwar independence, and political instability. Between 1975 and 1979 the country was devastated by the reign of the Khmer Rouge, a rural communist guerrilla movement. During the Khmer Rouge’s period of power, at least 1.5 million Cambodians were killed or died, a monumental tragedy from which the country still suffers.`
}
export default localContent;